# DividedSurfacePatternFlip Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfacePatternFlip Property
ParameterTypeId Class See Also
---
"Component Flip"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfacePatternFlip { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfacePatternFlip As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfacePatternFlip {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace